programming/java/code/tutorial/basic/data.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Numbers and Strings</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Numbers and Strings</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0ee9eeb"><code>data/Adder.java</code></a></li>
<li><a href="#orgda99e43"><code>data/Anagram.java</code></a></li>
<li><a href="#org72bd7ba"><code>data/ArrayCopyDemo.java</code></a></li>
<li><a href="#orgca2db36"><code>data/ArrayDemo.java</code></a></li>
<li><a href="#org376e05c"><code>data/ArrayOfArraysDemo2.java</code></a></li>
<li><a href="#org9d11b41"><code>data/ArrayOfArraysDemo.java</code></a></li>
<li><a href="#org54f2b75"><code>data/ArrayOfStringsDemo.java</code></a></li>
<li><a href="#orgd400ac6"><code>data/BasicMathDemo.java</code></a></li>
<li><a href="#orgac8e327"><code>data/BostonAccentDemo.java</code></a></li>
<li><a href="#org3c46c30"><code>data/CharacterDemo.java</code></a></li>
<li><a href="#org9512167"><code>data/ComputeInitials.java</code></a></li>
<li><a href="#org9e4f023"><code>data/ComputeResult.java</code></a></li>
<li><a href="#org65156ad"><code>data/DecimalFormatDemo.java</code></a></li>
<li><a href="#orgeede6c7"><code>data/ExponentialDemo.java</code></a></li>
<li><a href="#orgaa06158"><code>data/FilenameDemo.java</code></a></li>
<li><a href="#org8e550b1"><code>data/Filename.java</code></a></li>
<li><a href="#org0f98fdd"><code>data/FPAdder.java</code></a></li>
<li><a href="#org81450fe"><code>data/InsertDemo.java</code></a></li>
<li><a href="#org21f182b"><code>data/MaxVariablesDemo.java</code></a></li>
<li><a href="#org65414a1"><code>data/MinDemo.java</code></a></li>
<li><a href="#org1b6c52a"><code>data/MinVariablesDemo.java</code></a></li>
<li><a href="#org6be8092"><code>data/NumberDemo.java</code></a></li>
<li><a href="#orge4aaa6c"><code>data/Palindrome.java</code></a></li>
<li><a href="#orgb930ce0"><code>data/Point.java</code></a></li>
<li><a href="#org8afac0e"><code>data/Rectangle.java</code></a></li>
<li><a href="#org02665dc"><code>data/RegionMatchesDemo.java</code></a></li>
<li><a href="#orgdba41ef"><code>data/ReverseString.java</code></a></li>
<li><a href="#org8eee9c6"><code>data/ReverseStringTest.java</code></a></li>
<li><a href="#orgbfb4ca9"><code>data/SimplePoint.java</code></a></li>
<li><a href="#org696727f"><code>data/SimpleRectangle.java</code></a></li>
<li><a href="#org8c30bdf"><code>data/StringBuilderDemo.java</code></a></li>
<li><a href="#org44cac92"><code>data/StringDemo.java</code></a></li>
<li><a href="#org11c18d6"><code>data/StringsDemo.java</code></a></li>
<li><a href="#org96a73df"><code>data/TestFormat.java</code></a></li>
<li><a href="#org88ee399"><code>data/ThisHappens.java</code></a></li>
<li><a href="#org9e868b0"><code>data/ToStringDemo.java</code></a></li>
<li><a href="#orgf9584c8"><code>data/TrigonometricDemo.java</code></a></li>
<li><a href="#orgf0fc189"><code>data/Unboxing.java</code></a></li>
<li><a href="#org2536273"><code>data/ValueOfDemo.java</code></a></li>
<li><a href="#org1cbf606"><code>data/WhatHappens.java</code></a></li>
</ul>
</div>
</div>

<div id="outline-container-org0ee9eeb" class="outline-2">
<h2 id="org0ee9eeb"><code>data/Adder.java</code></h2>
<div class="outline-text-2" id="text-org0ee9eeb">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Adder</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 3: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">numArgs</span> = args.length;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">this program requires at least two arguments on the command line</span>
<span class="linenr"> 6: </span>    <span style="color: #56b4e9; font-weight: bold;">if</span> (numArgs &lt; 2) {
<span class="linenr"> 7: </span>      System.out.println(<span style="color: #848ea9;">"This program requires two command-line arguments."</span>);
<span class="linenr"> 8: </span>    } <span style="color: #56b4e9; font-weight: bold;">else</span> {
<span class="linenr"> 9: </span>      <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">sum</span> = 0;
<span class="linenr">10: </span>
<span class="linenr">11: </span>      <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span> = 0; i &lt; <span style="color: #0072b2; font-weight: bold;">numArgs</span>; i++) {
<span class="linenr">12: </span>        sum += Integer.valueOf(args[i]).intValue();
<span class="linenr">13: </span>      }
<span class="linenr">14: </span>
<span class="linenr">15: </span>      <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">print the sum</span>
<span class="linenr">16: </span>      System.out.println(sum);
<span class="linenr">17: </span>    }
<span class="linenr">18: </span>  }
<span class="linenr">19: </span>}
</pre>
</div>
</div>
</div>
