programming/java/code/tutorial/basic/data.html

<div id="outline-container-orgda99e43" class="outline-2">
<h2 id="orgda99e43"><code>data/Anagram.java</code></h2>
<div class="outline-text-2" id="text-orgda99e43">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Anagram</span> {
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span>  <span style="color: #848ea9;">/**</span>
<span class="linenr"> 4: </span><span style="color: #848ea9;">   * Tests whether the passed-in strings are anagrams -- containing the exact same number of each</span>
<span class="linenr"> 5: </span><span style="color: #848ea9;">   * letter. Punctuation, case, and order don't matter.</span>
<span class="linenr"> 6: </span><span style="color: #848ea9;">   *</span>
<span class="linenr"> 7: </span><span style="color: #848ea9;">   * </span><span style="color: #d55e00; font-weight: bold;">@return</span><span style="color: #848ea9;"> true if the strings are anagrams; otherwise, false</span>
<span class="linenr"> 8: </span><span style="color: #848ea9;">   */</span>
<span class="linenr"> 9: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">boolean</span> <span style="color: #d55e00;">areAnagrams</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">string1</span>, <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">string2</span>) {
<span class="linenr">10: </span>
<span class="linenr">11: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">workingCopy1</span> = removeJunk(string1);
<span class="linenr">12: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">workingCopy2</span> = removeJunk(string2);
<span class="linenr">13: </span>
<span class="linenr">14: </span>    workingCopy1 = workingCopy1.toLowerCase();
<span class="linenr">15: </span>    workingCopy2 = workingCopy2.toLowerCase();
<span class="linenr">16: </span>
<span class="linenr">17: </span>    workingCopy1 = sort(workingCopy1);
<span class="linenr">18: </span>    workingCopy2 = sort(workingCopy2);
<span class="linenr">19: </span>
<span class="linenr">20: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> workingCopy1.equals(workingCopy2);
<span class="linenr">21: </span>  }
<span class="linenr">22: </span>
<span class="linenr">23: </span>  <span style="color: #848ea9;">/**</span>
<span class="linenr">24: </span><span style="color: #848ea9;">   * Removes punctuation </span><span style="color: #d55e00; font-weight: bold; font-style: italic;">&amp;</span><span style="color: #848ea9;"> spaces -- everything except letters from the passed-in string.</span>
<span class="linenr">25: </span><span style="color: #848ea9;">   *</span>
<span class="linenr">26: </span><span style="color: #848ea9;">   * </span><span style="color: #d55e00; font-weight: bold;">@return</span><span style="color: #848ea9;"> a stripped copy of the passed-in string</span>
<span class="linenr">27: </span><span style="color: #848ea9;">   */</span>
<span class="linenr">28: </span>  <span style="color: #56b4e9; font-weight: bold;">protected</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">removeJunk</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">string</span>) {
<span class="linenr">29: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;
<span class="linenr">30: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">len</span> = string.length();
<span class="linenr">31: </span>    <span style="color: #0072b2; font-weight: bold;">StringBuilder</span> <span style="color: #e69f00; font-weight: bold;">dest</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">StringBuilder</span>(len);
<span class="linenr">32: </span>    <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">c</span>;
<span class="linenr">33: </span>
<span class="linenr">34: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = (len - 1); i &gt;= 0; i--) {
<span class="linenr">35: </span>      c = string.charAt(i);
<span class="linenr">36: </span>      <span style="color: #56b4e9; font-weight: bold;">if</span> (Character.isLetter(c)) {
<span class="linenr">37: </span>        dest.append(c);
<span class="linenr">38: </span>      }
<span class="linenr">39: </span>    }
<span class="linenr">40: </span>
<span class="linenr">41: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> dest.toString();
<span class="linenr">42: </span>  }
<span class="linenr">43: </span>
<span class="linenr">44: </span>  <span style="color: #848ea9;">/**</span>
<span class="linenr">45: </span><span style="color: #848ea9;">   * Sorts the passed-in string.</span>
<span class="linenr">46: </span><span style="color: #848ea9;">   *</span>
<span class="linenr">47: </span><span style="color: #848ea9;">   * </span><span style="color: #d55e00; font-weight: bold;">@return</span><span style="color: #848ea9;"> a sorted copy of the passed-in string</span>
<span class="linenr">48: </span><span style="color: #848ea9;">   */</span>
<span class="linenr">49: </span>  <span style="color: #56b4e9; font-weight: bold;">protected</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">sort</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">string</span>) {
<span class="linenr">50: </span>    <span style="color: #0072b2; font-weight: bold;">char</span>[] <span style="color: #e69f00; font-weight: bold;">charArray</span> = string.toCharArray();
<span class="linenr">51: </span>
<span class="linenr">52: </span>    <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.Arrays.sort(charArray);
<span class="linenr">53: </span>
<span class="linenr">54: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">String</span>(charArray);
<span class="linenr">55: </span>  }
<span class="linenr">56: </span>
<span class="linenr">57: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">58: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">string1</span> = <span style="color: #848ea9;">"Cosmo and Laine:"</span>;
<span class="linenr">59: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">string2</span> = <span style="color: #848ea9;">"Maid, clean soon!"</span>;
<span class="linenr">60: </span>
<span class="linenr">61: </span>    System.out.println();
<span class="linenr">62: </span>    System.out.println(<span style="color: #848ea9;">"Testing whether the following "</span> + <span style="color: #848ea9;">"strings are anagrams:"</span>);
<span class="linenr">63: </span>    System.out.println(<span style="color: #848ea9;">"    String 1: "</span> + string1);
<span class="linenr">64: </span>    System.out.println(<span style="color: #848ea9;">"    String 2: "</span> + string2);
<span class="linenr">65: </span>    System.out.println();
<span class="linenr">66: </span>
<span class="linenr">67: </span>    <span style="color: #56b4e9; font-weight: bold;">if</span> (areAnagrams(string1, string2)) {
<span class="linenr">68: </span>      System.out.println(<span style="color: #848ea9;">"They ARE anagrams!"</span>);
<span class="linenr">69: </span>    } <span style="color: #56b4e9; font-weight: bold;">else</span> {
<span class="linenr">70: </span>      System.out.println(<span style="color: #848ea9;">"They are NOT anagrams!"</span>);
<span class="linenr">71: </span>    }
<span class="linenr">72: </span>    System.out.println();
<span class="linenr">73: </span>  }
<span class="linenr">74: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org72bd7ba" class="outline-2">
<h2 id="org72bd7ba"><code>data/ArrayCopyDemo.java</code></h2>
<div class="outline-text-2" id="text-org72bd7ba">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr">1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">ArrayCopyDemo</span> {
<span class="linenr">2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">3: </span>    <span style="color: #0072b2; font-weight: bold;">char</span>[] <span style="color: #e69f00; font-weight: bold;">copyFrom</span> = {<span style="color: #848ea9;">'d'</span>, <span style="color: #848ea9;">'e'</span>, <span style="color: #848ea9;">'c'</span>, <span style="color: #848ea9;">'a'</span>, <span style="color: #848ea9;">'f'</span>, <span style="color: #848ea9;">'f'</span>, <span style="color: #848ea9;">'e'</span>, <span style="color: #848ea9;">'i'</span>, <span style="color: #848ea9;">'n'</span>, <span style="color: #848ea9;">'a'</span>, <span style="color: #848ea9;">'t'</span>, <span style="color: #848ea9;">'e'</span>, <span style="color: #848ea9;">'d'</span>};
<span class="linenr">4: </span>    <span style="color: #0072b2; font-weight: bold;">char</span>[] <span style="color: #e69f00; font-weight: bold;">copyTo</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">char</span>[7];
<span class="linenr">5: </span>
<span class="linenr">6: </span>    System.arraycopy(copyFrom, 2, copyTo, 0, 7);
<span class="linenr">7: </span>    System.out.println(<span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">String</span>(copyTo));
<span class="linenr">8: </span>  }
<span class="linenr">9: </span>}
</pre>
</div>
</div>
</div>
