programming/java/code/tutorial/basic/data.org
* =data/ArrayDemo.java=

#+BEGIN_SRC java -n :bangle ArrayDemo.java :padline no
public class ArrayDemo {
  public static void main(String[] args) {
    int[] anArray; // declare an array of integers

    anArray = new int[10]; // create an array of integers

    // assign a value to each array element and print
    for (int i = 0; i < anArray.length; i++) {
      anArray[i] = i;
      System.out.print(anArray[i] + " ");
    }
    System.out.println();
  }
}
#+END_SRC

* =data/ArrayOfArraysDemo2.java=

#+BEGIN_SRC java -n :bangle ArrayOfArraysDemo2.java :padline no
public class ArrayOfArraysDemo2 {
  public static void main(String[] args) {
    int[][] aMatrix = new int[4][];

    // populate matrix
    for (int i = 0; i < aMatrix.length; i++) {
      aMatrix[i] = new int[5]; // create sub-array
      for (int j = 0; j < aMatrix[i].length; j++) {
        aMatrix[i][j] = i + j;
      }
    }

    // print matrix
    for (int i = 0; i < aMatrix.length; i++) {
      for (int j = 0; j < aMatrix[i].length; j++) {
        System.out.print(aMatrix[i][j] + " ");
      }
      System.out.println();
    }
  }
}
#+END_SRC

* =data/ArrayOfArraysDemo.java=

#+BEGIN_SRC java -n :bangle ArrayOfArraysDemo.java :padline no
public class ArrayOfArraysDemo {
  public static void main(String[] args) {
    String[][] cartoons = {
      {"Flintstones", "Fred", "Wilma", "Pebbles", "Dino"},
      {"Rubbles", "Barney", "Betty", "Bam Bam"},
      {"Jetsons", "George", "Jane", "Elroy", "Judy", "Rosie", "Astro"},
      {"Scooby Doo Gang", "Scooby Doo", "Shaggy", "Velma", "Fred", "Daphne"}
    };

    for (int i = 0; i < cartoons.length; i++) {
      System.out.print(cartoons[i][0] + ": ");
      for (int j = 1; j < cartoons[i].length; j++) {
        System.out.print(cartoons[i][j] + " ");
      }
      System.out.println();
    }
  }
}
#+END_SRC

* =data/ArrayOfStringsDemo.java=

#+BEGIN_SRC java -n :bangle ArrayOfStringsDemo.java :padline no
public class ArrayOfStringsDemo {
  public static void main(String[] args) {
    String[] anArray = {"String One", "String Two", "String Three"};

    for (String s : anArray) {
      System.out.println(s.toLowerCase());
    }
  }
}
#+END_SRC

