programming/java/code/tutorial/basic/data.html

<div id="outline-container-orgca2db36" class="outline-2">
<h2 id="orgca2db36"><code>data/ArrayDemo.java</code></h2>
<div class="outline-text-2" id="text-orgca2db36">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">ArrayDemo</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 3: </span>    <span style="color: #0072b2; font-weight: bold;">int</span>[] <span style="color: #e69f00; font-weight: bold;">anArray</span>; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">declare an array of integers</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>    anArray = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">int</span>[10]; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">create an array of integers</span>
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">assign a value to each array element and print</span>
<span class="linenr"> 8: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span> = 0; i &lt; anArray.<span style="color: #0072b2; font-weight: bold;">length</span>; i++) {
<span class="linenr"> 9: </span>      anArray[i] = i;
<span class="linenr">10: </span>      System.out.print(anArray[i] + <span style="color: #848ea9;">" "</span>);
<span class="linenr">11: </span>    }
<span class="linenr">12: </span>    System.out.println();
<span class="linenr">13: </span>  }
<span class="linenr">14: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org376e05c" class="outline-2">
<h2 id="org376e05c"><code>data/ArrayOfArraysDemo2.java</code></h2>
<div class="outline-text-2" id="text-org376e05c">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">ArrayOfArraysDemo2</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 3: </span>    <span style="color: #0072b2; font-weight: bold;">int</span>[][] <span style="color: #e69f00; font-weight: bold;">aMatrix</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">int</span>[4][];
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">populate matrix</span>
<span class="linenr"> 6: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span> = 0; i &lt; aMatrix.<span style="color: #0072b2; font-weight: bold;">length</span>; i++) {
<span class="linenr"> 7: </span>      aMatrix[i] = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">int</span>[5]; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">create sub-array</span>
<span class="linenr"> 8: </span>      <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">j</span> = 0; j &lt; <span style="color: #0072b2; font-weight: bold;">aMatrix</span>[i].length; j++) {
<span class="linenr"> 9: </span>        aMatrix[i][j] = i + j;
<span class="linenr">10: </span>      }
<span class="linenr">11: </span>    }
<span class="linenr">12: </span>
<span class="linenr">13: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">print matrix</span>
<span class="linenr">14: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span> = 0; i &lt; aMatrix.<span style="color: #0072b2; font-weight: bold;">length</span>; i++) {
<span class="linenr">15: </span>      <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">j</span> = 0; j &lt; <span style="color: #0072b2; font-weight: bold;">aMatrix</span>[i].length; j++) {
<span class="linenr">16: </span>        System.out.print(aMatrix[i][j] + <span style="color: #848ea9;">" "</span>);
<span class="linenr">17: </span>      }
<span class="linenr">18: </span>      System.out.println();
<span class="linenr">19: </span>    }
<span class="linenr">20: </span>  }
<span class="linenr">21: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9d11b41" class="outline-2">
<h2 id="org9d11b41"><code>data/ArrayOfArraysDemo.java</code></h2>
<div class="outline-text-2" id="text-org9d11b41">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">ArrayOfArraysDemo</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 3: </span>    <span style="color: #0072b2; font-weight: bold;">String</span>[][] <span style="color: #e69f00; font-weight: bold;">cartoons</span> = {
<span class="linenr"> 4: </span>      {<span style="color: #848ea9;">"Flintstones"</span>, <span style="color: #848ea9;">"Fred"</span>, <span style="color: #848ea9;">"Wilma"</span>, <span style="color: #848ea9;">"Pebbles"</span>, <span style="color: #848ea9;">"Dino"</span>},
<span class="linenr"> 5: </span>      {<span style="color: #848ea9;">"Rubbles"</span>, <span style="color: #848ea9;">"Barney"</span>, <span style="color: #848ea9;">"Betty"</span>, <span style="color: #848ea9;">"Bam Bam"</span>},
<span class="linenr"> 6: </span>      {<span style="color: #848ea9;">"Jetsons"</span>, <span style="color: #848ea9;">"George"</span>, <span style="color: #848ea9;">"Jane"</span>, <span style="color: #848ea9;">"Elroy"</span>, <span style="color: #848ea9;">"Judy"</span>, <span style="color: #848ea9;">"Rosie"</span>, <span style="color: #848ea9;">"Astro"</span>},
<span class="linenr"> 7: </span>      {<span style="color: #848ea9;">"Scooby Doo Gang"</span>, <span style="color: #848ea9;">"Scooby Doo"</span>, <span style="color: #848ea9;">"Shaggy"</span>, <span style="color: #848ea9;">"Velma"</span>, <span style="color: #848ea9;">"Fred"</span>, <span style="color: #848ea9;">"Daphne"</span>}
<span class="linenr"> 8: </span>    };
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span> = 0; i &lt; cartoons.<span style="color: #0072b2; font-weight: bold;">length</span>; i++) {
<span class="linenr">11: </span>      System.out.print(cartoons[i][0] + <span style="color: #848ea9;">": "</span>);
<span class="linenr">12: </span>      <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">j</span> = 1; j &lt; <span style="color: #0072b2; font-weight: bold;">cartoons</span>[i].length; j++) {
<span class="linenr">13: </span>        System.out.print(cartoons[i][j] + <span style="color: #848ea9;">" "</span>);
<span class="linenr">14: </span>      }
<span class="linenr">15: </span>      System.out.println();
<span class="linenr">16: </span>    }
<span class="linenr">17: </span>  }
<span class="linenr">18: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org54f2b75" class="outline-2">
<h2 id="org54f2b75"><code>data/ArrayOfStringsDemo.java</code></h2>
<div class="outline-text-2" id="text-org54f2b75">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr">1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">ArrayOfStringsDemo</span> {
<span class="linenr">2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">3: </span>    <span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">anArray</span> = {<span style="color: #848ea9;">"String One"</span>, <span style="color: #848ea9;">"String Two"</span>, <span style="color: #848ea9;">"String Three"</span>};
<span class="linenr">4: </span>
<span class="linenr">5: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">s</span> : anArray) {
<span class="linenr">6: </span>      System.out.println(s.toLowerCase());
<span class="linenr">7: </span>    }
<span class="linenr">8: </span>  }
<span class="linenr">9: </span>}
</pre>
</div>
</div>
</div>
