programming/java/code/tutorial/basic/data.org
* =data/BasicMathDemo.java=

#+BEGIN_SRC java -n :bangle BasicMathDemo.java :padline no
public class BasicMathDemo {
  public static void main(String[] args) {
    double a = -191.635;
    double b = 43.74;
    int c = 16, d = 45;

    System.out.printf("The absolute value " + "of %.3f is %.3f%n", a, Math.abs(a));

    System.out.printf("The ceiling of " + "%.2f is %.0f%n", b, Math.ceil(b));

    System.out.printf("The floor of " + "%.2f is %.0f%n", b, Math.floor(b));

    System.out.printf("The rint of %.2f " + "is %.0f%n", b, Math.rint(b));

    System.out.printf("The max of %d and " + "%d is %d%n", c, d, Math.max(c, d));

    System.out.printf("The min of of %d " + "and %d is %d%n", c, d, Math.min(c, d));
  }
}
#+END_SRC

* =data/BostonAccentDemo.java=

#+BEGIN_SRC java -n :bangle BostonAccentDemo.java :padline no
public class BostonAccentDemo {
  private static void bostonAccent(String sentence) {
    char r = 'r';
    char h = 'h';
    String translatedSentence = sentence.replace(r, h);
    System.out.println(translatedSentence);
  }

  public static void main(String[] args) {
    String translateThis = "Park the car in Harvard yard.";
    bostonAccent(translateThis);
  }
}
#+END_SRC

* =data/CharacterDemo.java=

#+BEGIN_SRC java -n :bangle CharacterDemo.java :padline no
public class CharacterDemo {
  public static void main(String args[]) {
    Character a = new Character('a');
    Character a2 = new Character('a');
    Character b = new Character('b');

    int difference = a.compareTo(b);

    if (difference == 0) {
      System.out.println("a is equal to b.");
    } else if (difference < 0) {
      System.out.println("a is less than b.");
    } else if (difference > 0) {
      System.out.println("a is greater than b.");
    }

    System.out.println("a is " + ((a.equals(a2)) ? "equal" : "not equal") + " to a2.");

    System.out.println(
        "The character "
            + a.toString()
            + " is "
            + (Character.isUpperCase(a.charValue()) ? "upper" : "lower")
            + "case.");
  }
}
#+END_SRC

* =data/ComputeInitials.java=

#+BEGIN_SRC java -n :bangle ComputeInitials.java :padline no
public class ComputeInitials {
  public static void main(String[] args) {
    String myName = "Fred F. Flintstone";
    StringBuffer myInitials = new StringBuffer();
    int length = myName.length();

    for (int i = 0; i < length; i++) {
      if (Character.isUpperCase(myName.charAt(i))) {
        myInitials.append(myName.charAt(i));
      }
    }
    System.out.println("My initials are: " + myInitials);
  }
}
#+END_SRC

