programming/java/code/tutorial/basic/data.html

<div id="outline-container-orgd400ac6" class="outline-2">
<h2 id="orgd400ac6"><code>data/BasicMathDemo.java</code></h2>
<div class="outline-text-2" id="text-orgd400ac6">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">BasicMathDemo</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 3: </span>    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">a</span> = -191.635;
<span class="linenr"> 4: </span>    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">b</span> = 43.74;
<span class="linenr"> 5: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span> = 16, <span style="color: #e69f00; font-weight: bold;">d</span> = 45;
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>    System.out.printf(<span style="color: #848ea9;">"The absolute value "</span> + <span style="color: #848ea9;">"of %.3f is %.3f%n"</span>, a, Math.abs(a));
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>    System.out.printf(<span style="color: #848ea9;">"The ceiling of "</span> + <span style="color: #848ea9;">"%.2f is %.0f%n"</span>, b, Math.ceil(b));
<span class="linenr">10: </span>
<span class="linenr">11: </span>    System.out.printf(<span style="color: #848ea9;">"The floor of "</span> + <span style="color: #848ea9;">"%.2f is %.0f%n"</span>, b, Math.floor(b));
<span class="linenr">12: </span>
<span class="linenr">13: </span>    System.out.printf(<span style="color: #848ea9;">"The rint of %.2f "</span> + <span style="color: #848ea9;">"is %.0f%n"</span>, b, Math.rint(b));
<span class="linenr">14: </span>
<span class="linenr">15: </span>    System.out.printf(<span style="color: #848ea9;">"The max of %d and "</span> + <span style="color: #848ea9;">"%d is %d%n"</span>, c, d, Math.max(c, d));
<span class="linenr">16: </span>
<span class="linenr">17: </span>    System.out.printf(<span style="color: #848ea9;">"The min of of %d "</span> + <span style="color: #848ea9;">"and %d is %d%n"</span>, c, d, Math.min(c, d));
<span class="linenr">18: </span>  }
<span class="linenr">19: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgac8e327" class="outline-2">
<h2 id="orgac8e327"><code>data/BostonAccentDemo.java</code></h2>
<div class="outline-text-2" id="text-orgac8e327">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">BostonAccentDemo</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">bostonAccent</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">sentence</span>) {
<span class="linenr"> 3: </span>    <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">r</span> = <span style="color: #848ea9;">'r'</span>;
<span class="linenr"> 4: </span>    <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">h</span> = <span style="color: #848ea9;">'h'</span>;
<span class="linenr"> 5: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">translatedSentence</span> = sentence.replace(r, h);
<span class="linenr"> 6: </span>    System.out.println(translatedSentence);
<span class="linenr"> 7: </span>  }
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">10: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">translateThis</span> = <span style="color: #848ea9;">"Park the car in Harvard yard."</span>;
<span class="linenr">11: </span>    bostonAccent(translateThis);
<span class="linenr">12: </span>  }
<span class="linenr">13: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3c46c30" class="outline-2">
<h2 id="org3c46c30"><code>data/CharacterDemo.java</code></h2>
<div class="outline-text-2" id="text-org3c46c30">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">CharacterDemo</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">args</span>[]) {
<span class="linenr"> 3: </span>    <span style="color: #0072b2; font-weight: bold;">Character</span> <span style="color: #e69f00; font-weight: bold;">a</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Character</span>(<span style="color: #848ea9;">'a'</span>);
<span class="linenr"> 4: </span>    <span style="color: #0072b2; font-weight: bold;">Character</span> <span style="color: #e69f00; font-weight: bold;">a2</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Character</span>(<span style="color: #848ea9;">'a'</span>);
<span class="linenr"> 5: </span>    <span style="color: #0072b2; font-weight: bold;">Character</span> <span style="color: #e69f00; font-weight: bold;">b</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Character</span>(<span style="color: #848ea9;">'b'</span>);
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">difference</span> = a.compareTo(b);
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>    <span style="color: #56b4e9; font-weight: bold;">if</span> (difference == 0) {
<span class="linenr">10: </span>      System.out.println(<span style="color: #848ea9;">"a is equal to b."</span>);
<span class="linenr">11: </span>    } <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> (difference &lt; 0) {
<span class="linenr">12: </span>      System.out.println(<span style="color: #848ea9;">"a is less than b."</span>);
<span class="linenr">13: </span>    } <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> (difference &gt; 0) {
<span class="linenr">14: </span>      System.out.println(<span style="color: #848ea9;">"a is greater than b."</span>);
<span class="linenr">15: </span>    }
<span class="linenr">16: </span>
<span class="linenr">17: </span>    System.out.println(<span style="color: #848ea9;">"a is "</span> + ((a.equals(a2)) ? <span style="color: #848ea9;">"equal"</span> : <span style="color: #848ea9;">"not equal"</span>) + <span style="color: #848ea9;">" to a2."</span>);
<span class="linenr">18: </span>
<span class="linenr">19: </span>    System.out.println(
<span class="linenr">20: </span>        <span style="color: #848ea9;">"The character "</span>
<span class="linenr">21: </span>            + a.toString()
<span class="linenr">22: </span>            + <span style="color: #848ea9;">" is "</span>
<span class="linenr">23: </span>            + (Character.isUpperCase(a.charValue()) ? <span style="color: #848ea9;">"upper"</span> : <span style="color: #848ea9;">"lower"</span>)
<span class="linenr">24: </span>            + <span style="color: #848ea9;">"case."</span>);
<span class="linenr">25: </span>  }
<span class="linenr">26: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9512167" class="outline-2">
<h2 id="org9512167"><code>data/ComputeInitials.java</code></h2>
<div class="outline-text-2" id="text-org9512167">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">ComputeInitials</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 3: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">myName</span> = <span style="color: #848ea9;">"Fred F. Flintstone"</span>;
<span class="linenr"> 4: </span>    <span style="color: #0072b2; font-weight: bold;">StringBuffer</span> <span style="color: #e69f00; font-weight: bold;">myInitials</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">StringBuffer</span>();
<span class="linenr"> 5: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">length</span> = myName.length();
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span> = 0; i &lt; <span style="color: #0072b2; font-weight: bold;">length</span>; i++) {
<span class="linenr"> 8: </span>      <span style="color: #56b4e9; font-weight: bold;">if</span> (Character.isUpperCase(myName.charAt(i))) {
<span class="linenr"> 9: </span>        myInitials.append(myName.charAt(i));
<span class="linenr">10: </span>      }
<span class="linenr">11: </span>    }
<span class="linenr">12: </span>    System.out.println(<span style="color: #848ea9;">"My initials are: "</span> + myInitials);
<span class="linenr">13: </span>  }
<span class="linenr">14: </span>}
</pre>
</div>
</div>
</div>
