programming/java/code/tutorial/basic/data.org
* =data/ComputeResult.java=

#+BEGIN_SRC java -n :bangle ComputeResult.java :padline no
public class ComputeResult {
  public static void main(String[] args) {
    String original = "software";
    StringBuilder result = new StringBuilder("hi");
    int index = original.indexOf('a');

    /*1*/ result.setCharAt(0, original.charAt(0));
    /*2*/ result.setCharAt(1, original.charAt(original.length() - 1));
    /*3*/ result.insert(1, original.charAt(4));
    /*4*/ result.append(original.substring(1, 4));
    /*5*/ result.insert(3, (original.substring(index, index + 2) + " "));

    System.out.println(result);
  }
}
#+END_SRC

* =data/DecimalFormatDemo.java=

#+BEGIN_SRC java -n :bangle DecimalFormatDemo.java :padline no
import java.text.DecimalFormat;

public class DecimalFormatDemo {

  public static void customFormat(String pattern, double value) {
    DecimalFormat myFormatter = new DecimalFormat(pattern);
    String output = myFormatter.format(value);
    System.out.println(value + "  " + pattern + "  " + output);
  }

  public static void main(String[] args) {

    customFormat("###,###.###", 123456.789);
    customFormat("###.##", 123456.789);
    customFormat("000000.000", 123.78);
    customFormat("$###,###.###", 12345.67);
  }
}
#+END_SRC

* =data/ExponentialDemo.java=

#+BEGIN_SRC java -n :bangle ExponentialDemo.java :padline no
public class ExponentialDemo {
  public static void main(String[] args) {
    double x = 11.635;
    double y = 2.76;

    System.out.printf("The value of " + "e is %.4f%n", Math.E);

    System.out.printf("exp(%.3f) " + "is %.3f%n", x, Math.exp(x));

    System.out.printf("log(%.3f) is " + "%.3f%n", x, Math.log(x));

    System.out.printf("pow(%.3f, %.3f) " + "is %.3f%n", x, y, Math.pow(x, y));

    System.out.printf("sqrt(%.3f) is " + "%.3f%n", x, Math.sqrt(x));
  }
}
#+END_SRC

* =data/FilenameDemo.java=

#+BEGIN_SRC java -n :bangle FilenameDemo.java :padline no
public class FilenameDemo {
  public static void main(String[] args) {
    final String FPATH = "/home/user/index.html";
    Filename myHomePage = new Filename(FPATH, '/', '.');
    System.out.println("Extension = " + myHomePage.extension());
    System.out.println("Filename = " + myHomePage.filename());
    System.out.println("Path = " + myHomePage.path());
  }
}
#+END_SRC

