programming/java/code/tutorial/basic/data.html

<div id="outline-container-org9e4f023" class="outline-2">
<h2 id="org9e4f023"><code>data/ComputeResult.java</code></h2>
<div class="outline-text-2" id="text-org9e4f023">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">ComputeResult</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 3: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">original</span> = <span style="color: #848ea9;">"software"</span>;
<span class="linenr"> 4: </span>    <span style="color: #0072b2; font-weight: bold;">StringBuilder</span> <span style="color: #e69f00; font-weight: bold;">result</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">StringBuilder</span>(<span style="color: #848ea9;">"hi"</span>);
<span class="linenr"> 5: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">index</span> = original.indexOf(<span style="color: #848ea9;">'a'</span>);
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>    <span style="color: #009e73; font-style: italic;">/*</span><span style="color: #009e73; font-style: italic;">1*/</span> result.setCharAt(0, original.charAt(0));
<span class="linenr"> 8: </span>    <span style="color: #009e73; font-style: italic;">/*</span><span style="color: #009e73; font-style: italic;">2*/</span> result.setCharAt(1, original.charAt(original.length() - 1));
<span class="linenr"> 9: </span>    <span style="color: #009e73; font-style: italic;">/*</span><span style="color: #009e73; font-style: italic;">3*/</span> result.insert(1, original.charAt(4));
<span class="linenr">10: </span>    <span style="color: #009e73; font-style: italic;">/*</span><span style="color: #009e73; font-style: italic;">4*/</span> result.append(original.substring(1, 4));
<span class="linenr">11: </span>    <span style="color: #009e73; font-style: italic;">/*</span><span style="color: #009e73; font-style: italic;">5*/</span> result.insert(3, (original.substring(index, index + 2) + <span style="color: #848ea9;">" "</span>));
<span class="linenr">12: </span>
<span class="linenr">13: </span>    System.out.println(result);
<span class="linenr">14: </span>  }
<span class="linenr">15: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org65156ad" class="outline-2">
<h2 id="org65156ad"><code>data/DecimalFormatDemo.java</code></h2>
<div class="outline-text-2" id="text-org65156ad">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">text</span>.<span style="color: #0072b2; font-weight: bold;">DecimalFormat</span>;
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">DecimalFormatDemo</span> {
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">customFormat</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">pattern</span>, <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">value</span>) {
<span class="linenr"> 6: </span>    <span style="color: #0072b2; font-weight: bold;">DecimalFormat</span> <span style="color: #e69f00; font-weight: bold;">myFormatter</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">DecimalFormat</span>(pattern);
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">output</span> = myFormatter.format(value);
<span class="linenr"> 8: </span>    System.out.println(value + <span style="color: #848ea9;">"  "</span> + pattern + <span style="color: #848ea9;">"  "</span> + output);
<span class="linenr"> 9: </span>  }
<span class="linenr">10: </span>
<span class="linenr">11: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">12: </span>
<span class="linenr">13: </span>    customFormat(<span style="color: #848ea9;">"###,###.###"</span>, 123456.789);
<span class="linenr">14: </span>    customFormat(<span style="color: #848ea9;">"###.##"</span>, 123456.789);
<span class="linenr">15: </span>    customFormat(<span style="color: #848ea9;">"000000.000"</span>, 123.78);
<span class="linenr">16: </span>    customFormat(<span style="color: #848ea9;">"$###,###.###"</span>, 12345.67);
<span class="linenr">17: </span>  }
<span class="linenr">18: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeede6c7" class="outline-2">
<h2 id="orgeede6c7"><code>data/ExponentialDemo.java</code></h2>
<div class="outline-text-2" id="text-orgeede6c7">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">ExponentialDemo</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 3: </span>    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">x</span> = 11.635;
<span class="linenr"> 4: </span>    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">y</span> = 2.76;
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>    System.out.printf(<span style="color: #848ea9;">"The value of "</span> + <span style="color: #848ea9;">"e is %.4f%n"</span>, <span style="color: #d55e00; font-weight: bold;">Math</span>.E);
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    System.out.printf(<span style="color: #848ea9;">"exp(%.3f) "</span> + <span style="color: #848ea9;">"is %.3f%n"</span>, x, Math.exp(x));
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>    System.out.printf(<span style="color: #848ea9;">"log(%.3f) is "</span> + <span style="color: #848ea9;">"%.3f%n"</span>, x, Math.log(x));
<span class="linenr">11: </span>
<span class="linenr">12: </span>    System.out.printf(<span style="color: #848ea9;">"pow(%.3f, %.3f) "</span> + <span style="color: #848ea9;">"is %.3f%n"</span>, x, y, Math.pow(x, y));
<span class="linenr">13: </span>
<span class="linenr">14: </span>    System.out.printf(<span style="color: #848ea9;">"sqrt(%.3f) is "</span> + <span style="color: #848ea9;">"%.3f%n"</span>, x, Math.sqrt(x));
<span class="linenr">15: </span>  }
<span class="linenr">16: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa06158" class="outline-2">
<h2 id="orgaa06158"><code>data/FilenameDemo.java</code></h2>
<div class="outline-text-2" id="text-orgaa06158">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr">1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">FilenameDemo</span> {
<span class="linenr">2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">3: </span>    <span style="color: #56b4e9; font-weight: bold;">final</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">FPATH</span> = <span style="color: #848ea9;">"/home/user/index.html"</span>;
<span class="linenr">4: </span>    <span style="color: #0072b2; font-weight: bold;">Filename</span> <span style="color: #e69f00; font-weight: bold;">myHomePage</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Filename</span>(FPATH, <span style="color: #848ea9;">'/'</span>, <span style="color: #848ea9;">'.'</span>);
<span class="linenr">5: </span>    System.out.println(<span style="color: #848ea9;">"Extension = "</span> + myHomePage.extension());
<span class="linenr">6: </span>    System.out.println(<span style="color: #848ea9;">"Filename = "</span> + myHomePage.filename());
<span class="linenr">7: </span>    System.out.println(<span style="color: #848ea9;">"Path = "</span> + myHomePage.path());
<span class="linenr">8: </span>  }
<span class="linenr">9: </span>}
</pre>
</div>
</div>
</div>
