programming/java/code/tutorial/basic/data.org
* =data/Filename.java=

#+BEGIN_SRC java -n :bangle Filename.java :padline no
public class Filename {
  private String fullPath;
  private char pathSeparator;
  private char extensionSeparator;

  public Filename(String str, char sep, char ext) {
    fullPath = str;
    pathSeparator = sep;
    extensionSeparator = ext;
  }

  public String extension() {
    int dot = fullPath.lastIndexOf(extensionSeparator);
    return fullPath.substring(dot + 1);
  }

  // gets filename without extension
  public String filename() {
    int dot = fullPath.lastIndexOf(extensionSeparator);
    int sep = fullPath.lastIndexOf(pathSeparator);
    return fullPath.substring(sep + 1, dot);
  }

  public String path() {
    int sep = fullPath.lastIndexOf(pathSeparator);
    return fullPath.substring(0, sep);
  }
}
#+END_SRC

* =data/FPAdder.java=

#+BEGIN_SRC java -n :bangle FPAdder.java :padline no
import java.text.DecimalFormat;

public class FPAdder {
  public static void main(String[] args) {

    int numArgs = args.length;

    // this program requires at least two arguments on the command line
    if (numArgs < 2) {
      System.out.println("This program requires two command-line arguments.");
    } else {
      double sum = 0.0;

      for (int i = 0; i < numArgs; i++) {
        sum += Double.valueOf(args[i]).doubleValue();
      }

      // format the sum
      DecimalFormat myFormatter = new DecimalFormat("###,###.##");
      String output = myFormatter.format(sum);

      // print the sum
      System.out.println(output);
    }
  }
}
#+END_SRC

* =data/InsertDemo.java=

#+BEGIN_SRC java -n :bangle InsertDemo.java :padline no
public class InsertDemo {
  public static void main(String[] args) {
    StringBuffer palindrome = new StringBuffer("A man, a plan, a canal; Panama.");
    palindrome.insert(15, "a cat, ");
    System.out.println(palindrome);
  }
}
#+END_SRC

