programming/java/code/tutorial/basic/data.html

<div id="outline-container-org8e550b1" class="outline-2">
<h2 id="org8e550b1"><code>data/Filename.java</code></h2>
<div class="outline-text-2" id="text-org8e550b1">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Filename</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">fullPath</span>;
<span class="linenr"> 3: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">pathSeparator</span>;
<span class="linenr"> 4: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">extensionSeparator</span>;
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #d55e00;">Filename</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">str</span>, <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">sep</span>, <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">ext</span>) {
<span class="linenr"> 7: </span>    fullPath = str;
<span class="linenr"> 8: </span>    pathSeparator = sep;
<span class="linenr"> 9: </span>    extensionSeparator = ext;
<span class="linenr">10: </span>  }
<span class="linenr">11: </span>
<span class="linenr">12: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">extension</span>() {
<span class="linenr">13: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">dot</span> = fullPath.lastIndexOf(extensionSeparator);
<span class="linenr">14: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> fullPath.substring(dot + 1);
<span class="linenr">15: </span>  }
<span class="linenr">16: </span>
<span class="linenr">17: </span>  <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">gets filename without extension</span>
<span class="linenr">18: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">filename</span>() {
<span class="linenr">19: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">dot</span> = fullPath.lastIndexOf(extensionSeparator);
<span class="linenr">20: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">sep</span> = fullPath.lastIndexOf(pathSeparator);
<span class="linenr">21: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> fullPath.substring(sep + 1, dot);
<span class="linenr">22: </span>  }
<span class="linenr">23: </span>
<span class="linenr">24: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">path</span>() {
<span class="linenr">25: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">sep</span> = fullPath.lastIndexOf(pathSeparator);
<span class="linenr">26: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> fullPath.substring(0, sep);
<span class="linenr">27: </span>  }
<span class="linenr">28: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org0f98fdd" class="outline-2">
<h2 id="org0f98fdd"><code>data/FPAdder.java</code></h2>
<div class="outline-text-2" id="text-org0f98fdd">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">text</span>.<span style="color: #0072b2; font-weight: bold;">DecimalFormat</span>;
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">FPAdder</span> {
<span class="linenr"> 4: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">numArgs</span> = args.length;
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">this program requires at least two arguments on the command line</span>
<span class="linenr"> 9: </span>    <span style="color: #56b4e9; font-weight: bold;">if</span> (numArgs &lt; 2) {
<span class="linenr">10: </span>      System.out.println(<span style="color: #848ea9;">"This program requires two command-line arguments."</span>);
<span class="linenr">11: </span>    } <span style="color: #56b4e9; font-weight: bold;">else</span> {
<span class="linenr">12: </span>      <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">sum</span> = 0.0;
<span class="linenr">13: </span>
<span class="linenr">14: </span>      <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span> = 0; i &lt; <span style="color: #0072b2; font-weight: bold;">numArgs</span>; i++) {
<span class="linenr">15: </span>        sum += Double.valueOf(args[i]).doubleValue();
<span class="linenr">16: </span>      }
<span class="linenr">17: </span>
<span class="linenr">18: </span>      <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">format the sum</span>
<span class="linenr">19: </span>      <span style="color: #0072b2; font-weight: bold;">DecimalFormat</span> <span style="color: #e69f00; font-weight: bold;">myFormatter</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">DecimalFormat</span>(<span style="color: #848ea9;">"###,###.##"</span>);
<span class="linenr">20: </span>      <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">output</span> = myFormatter.format(sum);
<span class="linenr">21: </span>
<span class="linenr">22: </span>      <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">print the sum</span>
<span class="linenr">23: </span>      System.out.println(output);
<span class="linenr">24: </span>    }
<span class="linenr">25: </span>  }
<span class="linenr">26: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org81450fe" class="outline-2">
<h2 id="org81450fe"><code>data/InsertDemo.java</code></h2>
<div class="outline-text-2" id="text-org81450fe">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr">1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">InsertDemo</span> {
<span class="linenr">2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">3: </span>    <span style="color: #0072b2; font-weight: bold;">StringBuffer</span> <span style="color: #e69f00; font-weight: bold;">palindrome</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">StringBuffer</span>(<span style="color: #848ea9;">"A man, a plan, a canal; Panama."</span>);
<span class="linenr">4: </span>    palindrome.insert(15, <span style="color: #848ea9;">"a cat, "</span>);
<span class="linenr">5: </span>    System.out.println(palindrome);
<span class="linenr">6: </span>  }
<span class="linenr">7: </span>}
</pre>
</div>
</div>
</div>
