programming/java/code/tutorial/basic/data.org
* =data/MaxVariablesDemo.java=

#+BEGIN_SRC java -n :bangle MaxVariablesDemo.java :padline no
public class MaxVariablesDemo {
  public static void main(String args[]) {

    // integers
    byte largestByte = Byte.MAX_VALUE;
    short largestShort = Short.MAX_VALUE;
    int largestInteger = Integer.MAX_VALUE;
    long largestLong = Long.MAX_VALUE;

    // real numbers
    float largestFloat = Float.MAX_VALUE;
    double largestDouble = Double.MAX_VALUE;

    // other primitive types
    char aChar = 'S';
    boolean aBoolean = true;

    // Display them all.
    System.out.println("The largest byte value is " + largestByte + ".");
    System.out.println("The largest short value is " + largestShort + ".");
    System.out.println("The largest integer value is " + largestInteger + ".");
    System.out.println("The largest long value is " + largestLong + ".");

    System.out.println("The largest float value is " + largestFloat + ".");
    System.out.println("The largest double value is " + largestDouble + ".");

    if (Character.isUpperCase(aChar)) {
      System.out.println("The character " + aChar + " is uppercase.");
    } else {
      System.out.println("The character " + aChar + " is lowercase.");
    }
    System.out.println("The value of aBoolean is " + aBoolean + ".");
  }
}
#+END_SRC

* =data/MinDemo.java=

#+BEGIN_SRC java -n :bangle MinDemo.java :padline no
public class MinDemo {
  public static void main(String[] args) {

    double enrollmentPrice = 45.875;
    double closingPrice = 54.375;

    System.out.println("Your purchase price is: $" + Math.min(enrollmentPrice, closingPrice));
  }
}
#+END_SRC

* =data/MinVariablesDemo.java=

#+BEGIN_SRC java -n :bangle MinVariablesDemo.java :padline no
public class MinVariablesDemo {
  public static void main(String args[]) {

    // integers
    byte smallestByte = Byte.MIN_VALUE;
    short smallestShort = Short.MIN_VALUE;
    int smallestInteger = Integer.MIN_VALUE;
    long smallestLong = Long.MIN_VALUE;

    // real numbers
    float smallestFloat = Float.MIN_VALUE;
    double smallestDouble = Double.MIN_VALUE;

    // display them all
    System.out.println("The smallest byte value is " + smallestByte);
    System.out.println("The smallest short value is " + smallestShort);
    System.out.println("The smallest integer value is " + smallestInteger);
    System.out.println("The smallest long value is " + smallestLong);

    System.out.println("The smallest float value is " + smallestFloat);
    System.out.println("The smallest double value is " + smallestDouble);
  }
}
#+END_SRC

