programming/java/code/tutorial/basic/data.html

<div id="outline-container-org21f182b" class="outline-2">
<h2 id="org21f182b"><code>data/MaxVariablesDemo.java</code></h2>
<div class="outline-text-2" id="text-org21f182b">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">MaxVariablesDemo</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">args</span>[]) {
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">integers</span>
<span class="linenr"> 5: </span>    <span style="color: #0072b2; font-weight: bold;">byte</span> <span style="color: #e69f00; font-weight: bold;">largestByte</span> = <span style="color: #d55e00; font-weight: bold;">Byte</span>.MAX_VALUE;
<span class="linenr"> 6: </span>    <span style="color: #0072b2; font-weight: bold;">short</span> <span style="color: #e69f00; font-weight: bold;">largestShort</span> = <span style="color: #d55e00; font-weight: bold;">Short</span>.MAX_VALUE;
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">largestInteger</span> = <span style="color: #d55e00; font-weight: bold;">Integer</span>.MAX_VALUE;
<span class="linenr"> 8: </span>    <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #e69f00; font-weight: bold;">largestLong</span> = <span style="color: #d55e00; font-weight: bold;">Long</span>.MAX_VALUE;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">real numbers</span>
<span class="linenr">11: </span>    <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">largestFloat</span> = <span style="color: #d55e00; font-weight: bold;">Float</span>.MAX_VALUE;
<span class="linenr">12: </span>    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">largestDouble</span> = <span style="color: #d55e00; font-weight: bold;">Double</span>.MAX_VALUE;
<span class="linenr">13: </span>
<span class="linenr">14: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">other primitive types</span>
<span class="linenr">15: </span>    <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">aChar</span> = <span style="color: #848ea9;">'S'</span>;
<span class="linenr">16: </span>    <span style="color: #0072b2; font-weight: bold;">boolean</span> <span style="color: #e69f00; font-weight: bold;">aBoolean</span> = <span style="color: #d55e00; font-weight: bold;">true</span>;
<span class="linenr">17: </span>
<span class="linenr">18: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Display them all.</span>
<span class="linenr">19: </span>    System.out.println(<span style="color: #848ea9;">"The largest byte value is "</span> + largestByte + <span style="color: #848ea9;">"."</span>);
<span class="linenr">20: </span>    System.out.println(<span style="color: #848ea9;">"The largest short value is "</span> + largestShort + <span style="color: #848ea9;">"."</span>);
<span class="linenr">21: </span>    System.out.println(<span style="color: #848ea9;">"The largest integer value is "</span> + largestInteger + <span style="color: #848ea9;">"."</span>);
<span class="linenr">22: </span>    System.out.println(<span style="color: #848ea9;">"The largest long value is "</span> + largestLong + <span style="color: #848ea9;">"."</span>);
<span class="linenr">23: </span>
<span class="linenr">24: </span>    System.out.println(<span style="color: #848ea9;">"The largest float value is "</span> + largestFloat + <span style="color: #848ea9;">"."</span>);
<span class="linenr">25: </span>    System.out.println(<span style="color: #848ea9;">"The largest double value is "</span> + largestDouble + <span style="color: #848ea9;">"."</span>);
<span class="linenr">26: </span>
<span class="linenr">27: </span>    <span style="color: #56b4e9; font-weight: bold;">if</span> (Character.isUpperCase(aChar)) {
<span class="linenr">28: </span>      System.out.println(<span style="color: #848ea9;">"The character "</span> + aChar + <span style="color: #848ea9;">" is uppercase."</span>);
<span class="linenr">29: </span>    } <span style="color: #56b4e9; font-weight: bold;">else</span> {
<span class="linenr">30: </span>      System.out.println(<span style="color: #848ea9;">"The character "</span> + aChar + <span style="color: #848ea9;">" is lowercase."</span>);
<span class="linenr">31: </span>    }
<span class="linenr">32: </span>    System.out.println(<span style="color: #848ea9;">"The value of aBoolean is "</span> + aBoolean + <span style="color: #848ea9;">"."</span>);
<span class="linenr">33: </span>  }
<span class="linenr">34: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org65414a1" class="outline-2">
<h2 id="org65414a1"><code>data/MinDemo.java</code></h2>
<div class="outline-text-2" id="text-org65414a1">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr">1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">MinDemo</span> {
<span class="linenr">2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">3: </span>
<span class="linenr">4: </span>    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">enrollmentPrice</span> = 45.875;
<span class="linenr">5: </span>    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">closingPrice</span> = 54.375;
<span class="linenr">6: </span>
<span class="linenr">7: </span>    System.out.println(<span style="color: #848ea9;">"Your purchase price is: $"</span> + Math.min(enrollmentPrice, closingPrice));
<span class="linenr">8: </span>  }
<span class="linenr">9: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b6c52a" class="outline-2">
<h2 id="org1b6c52a"><code>data/MinVariablesDemo.java</code></h2>
<div class="outline-text-2" id="text-org1b6c52a">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">MinVariablesDemo</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">args</span>[]) {
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">integers</span>
<span class="linenr"> 5: </span>    <span style="color: #0072b2; font-weight: bold;">byte</span> <span style="color: #e69f00; font-weight: bold;">smallestByte</span> = <span style="color: #d55e00; font-weight: bold;">Byte</span>.MIN_VALUE;
<span class="linenr"> 6: </span>    <span style="color: #0072b2; font-weight: bold;">short</span> <span style="color: #e69f00; font-weight: bold;">smallestShort</span> = <span style="color: #d55e00; font-weight: bold;">Short</span>.MIN_VALUE;
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">smallestInteger</span> = <span style="color: #d55e00; font-weight: bold;">Integer</span>.MIN_VALUE;
<span class="linenr"> 8: </span>    <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #e69f00; font-weight: bold;">smallestLong</span> = <span style="color: #d55e00; font-weight: bold;">Long</span>.MIN_VALUE;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">real numbers</span>
<span class="linenr">11: </span>    <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">smallestFloat</span> = <span style="color: #d55e00; font-weight: bold;">Float</span>.MIN_VALUE;
<span class="linenr">12: </span>    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">smallestDouble</span> = <span style="color: #d55e00; font-weight: bold;">Double</span>.MIN_VALUE;
<span class="linenr">13: </span>
<span class="linenr">14: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">display them all</span>
<span class="linenr">15: </span>    System.out.println(<span style="color: #848ea9;">"The smallest byte value is "</span> + smallestByte);
<span class="linenr">16: </span>    System.out.println(<span style="color: #848ea9;">"The smallest short value is "</span> + smallestShort);
<span class="linenr">17: </span>    System.out.println(<span style="color: #848ea9;">"The smallest integer value is "</span> + smallestInteger);
<span class="linenr">18: </span>    System.out.println(<span style="color: #848ea9;">"The smallest long value is "</span> + smallestLong);
<span class="linenr">19: </span>
<span class="linenr">20: </span>    System.out.println(<span style="color: #848ea9;">"The smallest float value is "</span> + smallestFloat);
<span class="linenr">21: </span>    System.out.println(<span style="color: #848ea9;">"The smallest double value is "</span> + smallestDouble);
<span class="linenr">22: </span>  }
<span class="linenr">23: </span>}
</pre>
</div>
</div>
</div>
