programming/java/code/tutorial/basic/data.org
* =data/NumberDemo.java=

#+BEGIN_SRC java -n :bangle NumberDemo.java :padline no
public class NumberDemo {
  public static void main(String args[]) {
    Float floatOne = new Float(14.78f - 13.78f);
    Float floatTwo = Float.valueOf("1.0");
    Double doubleOne = new Double(1.0);

    int difference = floatOne.compareTo(floatTwo);

    if (difference == 0) {
      System.out.println("floatOne is equal to floatTwo.");
    } else if (difference < 0) {
      System.out.println("floatOne is less than floatTwo.");
    } else if (difference > 0) {
      System.out.println("floatOne is greater than floatTwo.");
    }

    System.out.println(
        "floatOne is " + ((floatOne.equals(doubleOne)) ? "equal" : "not equal") + " to doubleOne.");
  }
}
#+END_SRC

* =data/Palindrome.java=

#+BEGIN_SRC java -n :bangle Palindrome.java :padline no
public class Palindrome {

  public static boolean isPalindrome(String stringToTest) {
    String workingCopy = removeJunk(stringToTest);
    String reversedCopy = reverse(workingCopy);

    return reversedCopy.equalsIgnoreCase(workingCopy);
  }

  protected static String removeJunk(String string) {
    int i, len = string.length();
    StringBuilder dest = new StringBuilder(len);
    char c;

    for (i = (len - 1); i >= 0; i--) {
      c = string.charAt(i);
      if (Character.isLetterOrDigit(c)) {
        dest.append(c);
      }
    }

    return dest.toString();
  }

  protected static String reverse(String string) {
    StringBuilder sb = new StringBuilder(string);

    return sb.reverse().toString();
  }

  public static void main(String[] args) {
    String string = "Madam, I'm Adam.";

    System.out.println();
    System.out.println("Testing whether the following " + "string is a palindrome:");
    System.out.println("    " + string);
    System.out.println();

    if (isPalindrome(string)) {
      System.out.println("It IS a palindrome!");
    } else {
      System.out.println("It is NOT a palindrome!");
    }
    System.out.println();
  }
}
#+END_SRC

* =data/Point.java=

#+BEGIN_SRC java -n :bangle Point.java :padline no
public class Point {
  public int x = 0;
  public int y = 0;
  // a constructor!
  public Point(int x, int y) {
    this.x = x;
    this.y = y;
  }
}
#+END_SRC

