programming/java/code/tutorial/basic/data.html

<div id="outline-container-org6be8092" class="outline-2">
<h2 id="org6be8092"><code>data/NumberDemo.java</code></h2>
<div class="outline-text-2" id="text-org6be8092">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">NumberDemo</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">args</span>[]) {
<span class="linenr"> 3: </span>    <span style="color: #0072b2; font-weight: bold;">Float</span> <span style="color: #e69f00; font-weight: bold;">floatOne</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Float</span>(14.78f - 13.78f);
<span class="linenr"> 4: </span>    <span style="color: #0072b2; font-weight: bold;">Float</span> <span style="color: #e69f00; font-weight: bold;">floatTwo</span> = Float.valueOf(<span style="color: #848ea9;">"1.0"</span>);
<span class="linenr"> 5: </span>    <span style="color: #0072b2; font-weight: bold;">Double</span> <span style="color: #e69f00; font-weight: bold;">doubleOne</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Double</span>(1.0);
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">difference</span> = floatOne.compareTo(floatTwo);
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>    <span style="color: #56b4e9; font-weight: bold;">if</span> (difference == 0) {
<span class="linenr">10: </span>      System.out.println(<span style="color: #848ea9;">"floatOne is equal to floatTwo."</span>);
<span class="linenr">11: </span>    } <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> (difference &lt; 0) {
<span class="linenr">12: </span>      System.out.println(<span style="color: #848ea9;">"floatOne is less than floatTwo."</span>);
<span class="linenr">13: </span>    } <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> (difference &gt; 0) {
<span class="linenr">14: </span>      System.out.println(<span style="color: #848ea9;">"floatOne is greater than floatTwo."</span>);
<span class="linenr">15: </span>    }
<span class="linenr">16: </span>
<span class="linenr">17: </span>    System.out.println(
<span class="linenr">18: </span>        <span style="color: #848ea9;">"floatOne is "</span> + ((floatOne.equals(doubleOne)) ? <span style="color: #848ea9;">"equal"</span> : <span style="color: #848ea9;">"not equal"</span>) + <span style="color: #848ea9;">" to doubleOne."</span>);
<span class="linenr">19: </span>  }
<span class="linenr">20: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge4aaa6c" class="outline-2">
<h2 id="orge4aaa6c"><code>data/Palindrome.java</code></h2>
<div class="outline-text-2" id="text-orge4aaa6c">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Palindrome</span> {
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">boolean</span> <span style="color: #d55e00;">isPalindrome</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">stringToTest</span>) {
<span class="linenr"> 4: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">workingCopy</span> = removeJunk(stringToTest);
<span class="linenr"> 5: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">reversedCopy</span> = reverse(workingCopy);
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> reversedCopy.equalsIgnoreCase(workingCopy);
<span class="linenr"> 8: </span>  }
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>  <span style="color: #56b4e9; font-weight: bold;">protected</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">removeJunk</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">string</span>) {
<span class="linenr">11: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">len</span> = string.length();
<span class="linenr">12: </span>    <span style="color: #0072b2; font-weight: bold;">StringBuilder</span> <span style="color: #e69f00; font-weight: bold;">dest</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">StringBuilder</span>(len);
<span class="linenr">13: </span>    <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">c</span>;
<span class="linenr">14: </span>
<span class="linenr">15: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = (len - 1); i &gt;= 0; i--) {
<span class="linenr">16: </span>      c = string.charAt(i);
<span class="linenr">17: </span>      <span style="color: #56b4e9; font-weight: bold;">if</span> (Character.isLetterOrDigit(c)) {
<span class="linenr">18: </span>        dest.append(c);
<span class="linenr">19: </span>      }
<span class="linenr">20: </span>    }
<span class="linenr">21: </span>
<span class="linenr">22: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> dest.toString();
<span class="linenr">23: </span>  }
<span class="linenr">24: </span>
<span class="linenr">25: </span>  <span style="color: #56b4e9; font-weight: bold;">protected</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">reverse</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">string</span>) {
<span class="linenr">26: </span>    <span style="color: #0072b2; font-weight: bold;">StringBuilder</span> <span style="color: #e69f00; font-weight: bold;">sb</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">StringBuilder</span>(string);
<span class="linenr">27: </span>
<span class="linenr">28: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> sb.reverse().toString();
<span class="linenr">29: </span>  }
<span class="linenr">30: </span>
<span class="linenr">31: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">32: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">string</span> = <span style="color: #848ea9;">"Madam, I'm Adam."</span>;
<span class="linenr">33: </span>
<span class="linenr">34: </span>    System.out.println();
<span class="linenr">35: </span>    System.out.println(<span style="color: #848ea9;">"Testing whether the following "</span> + <span style="color: #848ea9;">"string is a palindrome:"</span>);
<span class="linenr">36: </span>    System.out.println(<span style="color: #848ea9;">"    "</span> + string);
<span class="linenr">37: </span>    System.out.println();
<span class="linenr">38: </span>
<span class="linenr">39: </span>    <span style="color: #56b4e9; font-weight: bold;">if</span> (isPalindrome(string)) {
<span class="linenr">40: </span>      System.out.println(<span style="color: #848ea9;">"It IS a palindrome!"</span>);
<span class="linenr">41: </span>    } <span style="color: #56b4e9; font-weight: bold;">else</span> {
<span class="linenr">42: </span>      System.out.println(<span style="color: #848ea9;">"It is NOT a palindrome!"</span>);
<span class="linenr">43: </span>    }
<span class="linenr">44: </span>    System.out.println();
<span class="linenr">45: </span>  }
<span class="linenr">46: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb930ce0" class="outline-2">
<h2 id="orgb930ce0"><code>data/Point.java</code></h2>
<div class="outline-text-2" id="text-orgb930ce0">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr">1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Point</span> {
<span class="linenr">2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">x</span> = 0;
<span class="linenr">3: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">y</span> = 0;
<span class="linenr">4: </span>  <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">a constructor!</span>
<span class="linenr">5: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #d55e00;">Point</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">x</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">y</span>) {
<span class="linenr">6: </span>    <span style="color: #56b4e9; font-weight: bold;">this</span>.x = x;
<span class="linenr">7: </span>    <span style="color: #56b4e9; font-weight: bold;">this</span>.y = y;
<span class="linenr">8: </span>  }
<span class="linenr">9: </span>}
</pre>
</div>
</div>
</div>
