programming/java/code/tutorial/basic/data.org
* =data/Rectangle.java=

#+BEGIN_SRC java -n :bangle Rectangle.java :padline no
public class Rectangle {
  /** The width of this rectangle. */
  public int width;

  /** The height of this rectangle. */
  public int height;

  /** The origin (lower-left corner) of this rectangle. */
  public Point origin;

  /**
   * Creates a rectangle with the specified size. The origin is (0, 0).
   *
   * @param w width of the rectangle
   * @param h height of the rectangle
   */
  public Rectangle(int w, int h) {
    this(new Point(0, 0), w, h);
  }

  /**
   * Creates a rectangle with the specified origin and size.
   *
   * @param p origin of the rectangle
   * @param w width of the rectangle
   * @param h height of the rectangle
   */
  public Rectangle(Point p, int w, int h) {
    origin = p;
    width = w;
    height = h;
  }

  /** Moves the rectangle to the specified origin. */
  public void move(int x, int y) {
    origin.x = x;
    origin.y = y;
  }

  /** Returns the computed area of the rectangle. */
  public int area() {
    return width * height;
  }
}
#+END_SRC

* =data/RegionMatchesDemo.java=

#+BEGIN_SRC java -n :bangle RegionMatchesDemo.java :padline no
public class RegionMatchesDemo {
  public static void main(String[] args) {
    String searchMe = "Green Eggs and Ham";
    String findMe = "Eggs";
    int searchMeLength = searchMe.length();
    int findMeLength = findMe.length();
    boolean foundIt = false;
    for (int i = 0; i <= (searchMeLength - findMeLength); i++) {
      if (searchMe.regionMatches(i, findMe, 0, findMeLength)) {
        foundIt = true;
        System.out.println(searchMe.substring(i, i + findMeLength));
        break;
      }
    }
    if (!foundIt) System.out.println("No match found.");
  }
}
#+END_SRC

* =data/ReverseString.java=

#+BEGIN_SRC java -n :bangle ReverseString.java :padline no
public class ReverseString {
  public static String reverseIt(String source) {
    int i, len = source.length();
    StringBuffer dest = new StringBuffer(len);

    for (i = (len - 1); i >= 0; i--) dest.append(source.charAt(i));
    return dest.toString();
  }
}
#+END_SRC

* =data/ReverseStringTest.java=

#+BEGIN_SRC java -n :bangle ReverseStringTest.java :padline no
public class ReverseStringTest {
  public static void main(String[] args) {
    String str = "What's going on?";
    System.out.println(ReverseString.reverseIt(str));
  }
}
#+END_SRC

* =data/SimplePoint.java=

#+BEGIN_SRC java -n :bangle SimplePoint.java :padline no
public class SimplePoint {
  public int x = 0;
  public int y = 0;
}
#+END_SRC

