programming/java/code/tutorial/basic/data.html

<div id="outline-container-org8afac0e" class="outline-2">
<h2 id="org8afac0e"><code>data/Rectangle.java</code></h2>
<div class="outline-text-2" id="text-org8afac0e">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Rectangle</span> {
<span class="linenr"> 2: </span>  <span style="color: #848ea9;">/** The width of this rectangle. */</span>
<span class="linenr"> 3: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">width</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>  <span style="color: #848ea9;">/** The height of this rectangle. */</span>
<span class="linenr"> 6: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">height</span>;
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>  <span style="color: #848ea9;">/** The origin (lower-left corner) of this rectangle. */</span>
<span class="linenr"> 9: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">Point</span> <span style="color: #e69f00; font-weight: bold;">origin</span>;
<span class="linenr">10: </span>
<span class="linenr">11: </span>  <span style="color: #848ea9;">/**</span>
<span class="linenr">12: </span><span style="color: #848ea9;">   * Creates a rectangle with the specified size. The origin is (0, 0).</span>
<span class="linenr">13: </span><span style="color: #848ea9;">   *</span>
<span class="linenr">14: </span><span style="color: #848ea9;">   * </span><span style="color: #d55e00; font-weight: bold;">@param</span><span style="color: #848ea9;"> w width of the rectangle</span>
<span class="linenr">15: </span><span style="color: #848ea9;">   * </span><span style="color: #d55e00; font-weight: bold;">@param</span><span style="color: #848ea9;"> h height of the rectangle</span>
<span class="linenr">16: </span><span style="color: #848ea9;">   */</span>
<span class="linenr">17: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #d55e00;">Rectangle</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">w</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">h</span>) {
<span class="linenr">18: </span>    <span style="color: #56b4e9; font-weight: bold;">this</span>(<span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Point</span>(0, 0), w, h);
<span class="linenr">19: </span>  }
<span class="linenr">20: </span>
<span class="linenr">21: </span>  <span style="color: #848ea9;">/**</span>
<span class="linenr">22: </span><span style="color: #848ea9;">   * Creates a rectangle with the specified origin and size.</span>
<span class="linenr">23: </span><span style="color: #848ea9;">   *</span>
<span class="linenr">24: </span><span style="color: #848ea9;">   * </span><span style="color: #d55e00; font-weight: bold;">@param</span><span style="color: #848ea9;"> p origin of the rectangle</span>
<span class="linenr">25: </span><span style="color: #848ea9;">   * </span><span style="color: #d55e00; font-weight: bold;">@param</span><span style="color: #848ea9;"> w width of the rectangle</span>
<span class="linenr">26: </span><span style="color: #848ea9;">   * </span><span style="color: #d55e00; font-weight: bold;">@param</span><span style="color: #848ea9;"> h height of the rectangle</span>
<span class="linenr">27: </span><span style="color: #848ea9;">   */</span>
<span class="linenr">28: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #d55e00;">Rectangle</span>(<span style="color: #0072b2; font-weight: bold;">Point</span> <span style="color: #e69f00; font-weight: bold;">p</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">w</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">h</span>) {
<span class="linenr">29: </span>    origin = p;
<span class="linenr">30: </span>    width = w;
<span class="linenr">31: </span>    height = h;
<span class="linenr">32: </span>  }
<span class="linenr">33: </span>
<span class="linenr">34: </span>  <span style="color: #848ea9;">/** Moves the rectangle to the specified origin. */</span>
<span class="linenr">35: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">move</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">x</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">y</span>) {
<span class="linenr">36: </span>    origin.x = x;
<span class="linenr">37: </span>    origin.y = y;
<span class="linenr">38: </span>  }
<span class="linenr">39: </span>
<span class="linenr">40: </span>  <span style="color: #848ea9;">/** Returns the computed area of the rectangle. */</span>
<span class="linenr">41: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">area</span>() {
<span class="linenr">42: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> width * height;
<span class="linenr">43: </span>  }
<span class="linenr">44: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org02665dc" class="outline-2">
<h2 id="org02665dc"><code>data/RegionMatchesDemo.java</code></h2>
<div class="outline-text-2" id="text-org02665dc">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">RegionMatchesDemo</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 3: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">searchMe</span> = <span style="color: #848ea9;">"Green Eggs and Ham"</span>;
<span class="linenr"> 4: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">findMe</span> = <span style="color: #848ea9;">"Eggs"</span>;
<span class="linenr"> 5: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">searchMeLength</span> = searchMe.length();
<span class="linenr"> 6: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">findMeLength</span> = findMe.length();
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">boolean</span> <span style="color: #e69f00; font-weight: bold;">foundIt</span> = <span style="color: #d55e00; font-weight: bold;">false</span>;
<span class="linenr"> 8: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span> = 0; i &lt;= (searchMeLength - findMeLength); i++) {
<span class="linenr"> 9: </span>      <span style="color: #56b4e9; font-weight: bold;">if</span> (searchMe.regionMatches(i, findMe, 0, findMeLength)) {
<span class="linenr">10: </span>        foundIt = <span style="color: #d55e00; font-weight: bold;">true</span>;
<span class="linenr">11: </span>        System.out.println(searchMe.substring(i, i + findMeLength));
<span class="linenr">12: </span>        <span style="color: #56b4e9; font-weight: bold;">break</span>;
<span class="linenr">13: </span>      }
<span class="linenr">14: </span>    }
<span class="linenr">15: </span>    <span style="color: #56b4e9; font-weight: bold;">if</span> (!foundIt) System.out.println(<span style="color: #848ea9;">"No match found."</span>);
<span class="linenr">16: </span>  }
<span class="linenr">17: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdba41ef" class="outline-2">
<h2 id="orgdba41ef"><code>data/ReverseString.java</code></h2>
<div class="outline-text-2" id="text-orgdba41ef">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr">1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">ReverseString</span> {
<span class="linenr">2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">reverseIt</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">source</span>) {
<span class="linenr">3: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">len</span> = source.length();
<span class="linenr">4: </span>    <span style="color: #0072b2; font-weight: bold;">StringBuffer</span> <span style="color: #e69f00; font-weight: bold;">dest</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">StringBuffer</span>(len);
<span class="linenr">5: </span>
<span class="linenr">6: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = (len - 1); i &gt;= 0; i--) dest.append(source.charAt(i));
<span class="linenr">7: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> dest.toString();
<span class="linenr">8: </span>  }
<span class="linenr">9: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8eee9c6" class="outline-2">
<h2 id="org8eee9c6"><code>data/ReverseStringTest.java</code></h2>
<div class="outline-text-2" id="text-org8eee9c6">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr">1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">ReverseStringTest</span> {
<span class="linenr">2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">3: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">str</span> = <span style="color: #848ea9;">"What's going on?"</span>;
<span class="linenr">4: </span>    System.out.println(ReverseString.reverseIt(str));
<span class="linenr">5: </span>  }
<span class="linenr">6: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbfb4ca9" class="outline-2">
<h2 id="orgbfb4ca9"><code>data/SimplePoint.java</code></h2>
<div class="outline-text-2" id="text-orgbfb4ca9">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr">1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">SimplePoint</span> {
<span class="linenr">2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">x</span> = 0;
<span class="linenr">3: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">y</span> = 0;
<span class="linenr">4: </span>}
</pre>
</div>
</div>
</div>
