programming/java/code/tutorial/basic/data.org
* =data/SimpleRectangle.java=

#+BEGIN_SRC java -n :bangle SimpleRectangle.java :padline no
public class SimpleRectangle {
  public int width = 0;
  public int height = 0;
  public SimplePoint origin = new SimplePoint();
}
#+END_SRC

* =data/StringBuilderDemo.java=

#+BEGIN_SRC java -n :bangle StringBuilderDemo.java :padline no
public class StringBuilderDemo {
  public static void main(String[] args) {
    String palindrome = "Dot saw I was Tod";

    StringBuilder sb = new StringBuilder(palindrome);

    sb.reverse(); // reverse it

    System.out.println(sb);
  }
}
#+END_SRC

* =data/StringDemo.java=

#+BEGIN_SRC java -n :bangle StringDemo.java :padline no
public class StringDemo {
  public static void main(String[] args) {
    String palindrome = "Dot saw I was Tod";
    int len = palindrome.length();
    char[] tempCharArray = new char[len];
    char[] charArray = new char[len];

    // put original string in an
    // array of chars
    for (int i = 0; i < len; i++) {
      tempCharArray[i] = palindrome.charAt(i);
    }

    // reverse array of chars
    for (int j = 0; j < len; j++) {
      charArray[j] = tempCharArray[len - 1 - j];
    }

    String reversePalindrome = new String(charArray);
    System.out.println(reversePalindrome);
  }
}
#+END_SRC

* =data/StringsDemo.java=

#+BEGIN_SRC java -n :bangle StringsDemo.java :padline no
public class StringsDemo {
  public static void main(String[] args) {
    String palindrome = "Dot saw I was Tod";
    int len = palindrome.length();
    StringBuilder dest = new StringBuilder(len);
    for (int i = (len - 1); i >= 0; i--) {
      dest.append(palindrome.charAt(i));
    }
    System.out.format("%s%n", dest.toString());
  }
}
#+END_SRC

* =data/TestFormat.java=

#+BEGIN_SRC java -n :bangle TestFormat.java :padline no
import java.util.Calendar;
import java.util.Locale;

public class TestFormat {

  public static void main(String[] args) {
    long n = 461012;
    System.out.format("%d%n", n);
    System.out.format("%08d%n", n);
    System.out.format("%+8d%n", n);
    System.out.format("%,8d%n", n);
    System.out.format("%+,8d%n%n", n);

    double pi = Math.PI;
    System.out.format("%f%n", pi);
    System.out.format("%.3f%n", pi);
    System.out.format("%10.3f%n", pi);
    System.out.format("%-10.3f%n", pi);
    System.out.format(Locale.FRANCE, "%-10.4f%n%n", pi);

    Calendar c = Calendar.getInstance();
    System.out.format("%tB %te, %tY%n", c, c, c);
    System.out.format("%tl:%tM %tp%n", c, c, c);
    System.out.format("%tD%n", c);
  }
}
#+END_SRC

