programming/java/code/tutorial/basic/data.html

<div id="outline-container-org696727f" class="outline-2">
<h2 id="org696727f"><code>data/SimpleRectangle.java</code></h2>
<div class="outline-text-2" id="text-org696727f">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr">1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">SimpleRectangle</span> {
<span class="linenr">2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">width</span> = 0;
<span class="linenr">3: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">height</span> = 0;
<span class="linenr">4: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">SimplePoint</span> <span style="color: #e69f00; font-weight: bold;">origin</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">SimplePoint</span>();
<span class="linenr">5: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c30bdf" class="outline-2">
<h2 id="org8c30bdf"><code>data/StringBuilderDemo.java</code></h2>
<div class="outline-text-2" id="text-org8c30bdf">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">StringBuilderDemo</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 3: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">palindrome</span> = <span style="color: #848ea9;">"Dot saw I was Tod"</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>    <span style="color: #0072b2; font-weight: bold;">StringBuilder</span> <span style="color: #e69f00; font-weight: bold;">sb</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">StringBuilder</span>(palindrome);
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>    sb.reverse(); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">reverse it</span>
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>    System.out.println(sb);
<span class="linenr">10: </span>  }
<span class="linenr">11: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org44cac92" class="outline-2">
<h2 id="org44cac92"><code>data/StringDemo.java</code></h2>
<div class="outline-text-2" id="text-org44cac92">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">StringDemo</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 3: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">palindrome</span> = <span style="color: #848ea9;">"Dot saw I was Tod"</span>;
<span class="linenr"> 4: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">len</span> = palindrome.length();
<span class="linenr"> 5: </span>    <span style="color: #0072b2; font-weight: bold;">char</span>[] <span style="color: #e69f00; font-weight: bold;">tempCharArray</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">char</span>[len];
<span class="linenr"> 6: </span>    <span style="color: #0072b2; font-weight: bold;">char</span>[] <span style="color: #e69f00; font-weight: bold;">charArray</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">char</span>[len];
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">put original string in an</span>
<span class="linenr"> 9: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">array of chars</span>
<span class="linenr">10: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span> = 0; i &lt; <span style="color: #0072b2; font-weight: bold;">len</span>; i++) {
<span class="linenr">11: </span>      tempCharArray[i] = palindrome.charAt(i);
<span class="linenr">12: </span>    }
<span class="linenr">13: </span>
<span class="linenr">14: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">reverse array of chars</span>
<span class="linenr">15: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">j</span> = 0; j &lt; <span style="color: #0072b2; font-weight: bold;">len</span>; j++) {
<span class="linenr">16: </span>      charArray[j] = tempCharArray[len - 1 - j];
<span class="linenr">17: </span>    }
<span class="linenr">18: </span>
<span class="linenr">19: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">reversePalindrome</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">String</span>(charArray);
<span class="linenr">20: </span>    System.out.println(reversePalindrome);
<span class="linenr">21: </span>  }
<span class="linenr">22: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org11c18d6" class="outline-2">
<h2 id="org11c18d6"><code>data/StringsDemo.java</code></h2>
<div class="outline-text-2" id="text-org11c18d6">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">StringsDemo</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 3: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">palindrome</span> = <span style="color: #848ea9;">"Dot saw I was Tod"</span>;
<span class="linenr"> 4: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">len</span> = palindrome.length();
<span class="linenr"> 5: </span>    <span style="color: #0072b2; font-weight: bold;">StringBuilder</span> <span style="color: #e69f00; font-weight: bold;">dest</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">StringBuilder</span>(len);
<span class="linenr"> 6: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span> = (len - 1); i &gt;= 0; i--) {
<span class="linenr"> 7: </span>      dest.append(palindrome.charAt(i));
<span class="linenr"> 8: </span>    }
<span class="linenr"> 9: </span>    System.out.format(<span style="color: #848ea9;">"%s%n"</span>, dest.toString());
<span class="linenr">10: </span>  }
<span class="linenr">11: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org96a73df" class="outline-2">
<h2 id="org96a73df"><code>data/TestFormat.java</code></h2>
<div class="outline-text-2" id="text-org96a73df">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Calendar</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Locale</span>;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">TestFormat</span> {
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #e69f00; font-weight: bold;">n</span> = 461012;
<span class="linenr"> 8: </span>    System.out.format(<span style="color: #848ea9;">"%d%n"</span>, n);
<span class="linenr"> 9: </span>    System.out.format(<span style="color: #848ea9;">"%08d%n"</span>, n);
<span class="linenr">10: </span>    System.out.format(<span style="color: #848ea9;">"%+8d%n"</span>, n);
<span class="linenr">11: </span>    System.out.format(<span style="color: #848ea9;">"%,8d%n"</span>, n);
<span class="linenr">12: </span>    System.out.format(<span style="color: #848ea9;">"%+,8d%n%n"</span>, n);
<span class="linenr">13: </span>
<span class="linenr">14: </span>    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">pi</span> = <span style="color: #d55e00; font-weight: bold;">Math</span>.PI;
<span class="linenr">15: </span>    System.out.format(<span style="color: #848ea9;">"%f%n"</span>, pi);
<span class="linenr">16: </span>    System.out.format(<span style="color: #848ea9;">"%.3f%n"</span>, pi);
<span class="linenr">17: </span>    System.out.format(<span style="color: #848ea9;">"%10.3f%n"</span>, pi);
<span class="linenr">18: </span>    System.out.format(<span style="color: #848ea9;">"%-10.3f%n"</span>, pi);
<span class="linenr">19: </span>    System.out.format(<span style="color: #d55e00; font-weight: bold;">Locale</span>.FRANCE, <span style="color: #848ea9;">"%-10.4f%n%n"</span>, pi);
<span class="linenr">20: </span>
<span class="linenr">21: </span>    <span style="color: #0072b2; font-weight: bold;">Calendar</span> <span style="color: #e69f00; font-weight: bold;">c</span> = Calendar.getInstance();
<span class="linenr">22: </span>    System.out.format(<span style="color: #848ea9;">"%tB %te, %tY%n"</span>, c, c, c);
<span class="linenr">23: </span>    System.out.format(<span style="color: #848ea9;">"%tl:%tM %tp%n"</span>, c, c, c);
<span class="linenr">24: </span>    System.out.format(<span style="color: #848ea9;">"%tD%n"</span>, c);
<span class="linenr">25: </span>  }
<span class="linenr">26: </span>}
</pre>
</div>
</div>
</div>
