programming/java/code/tutorial/basic/data.org
* =data/ThisHappens.java=

#+BEGIN_SRC java -n :bangle ThisHappens.java :padline no
public class ThisHappens {
  public static void main(String[] args) {
    StringBuffer[] stringBuffers = new StringBuffer[10];

    for (int i = 0; i < stringBuffers.length; i++) {
      stringBuffers[i] = new StringBuffer();
      stringBuffers[i].append("StringBuffer at index " + i);
    }
  }
}
#+END_SRC

* =data/ToStringDemo.java=

#+BEGIN_SRC java -n :bangle ToStringDemo.java :padline no
public class ToStringDemo {

  public static void main(String[] args) {
    double d = 858.48;
    String s = Double.toString(d);

    int dot = s.indexOf('.');

    System.out.println(dot + " digits " + "before decimal point.");
    System.out.println((s.length() - dot - 1) + " digits after decimal point.");
  }
}
#+END_SRC

* =data/TrigonometricDemo.java=

#+BEGIN_SRC java -n :bangle TrigonometricDemo.java :padline no
public class TrigonometricDemo {
  public static void main(String[] args) {
    double degrees = 45.0;
    double radians = Math.toRadians(degrees);

    System.out.format("The value of pi " + "is %.4f%n", Math.PI);

    System.out.format("The sine of %.1f " + "degrees is %.4f%n", degrees, Math.sin(radians));

    System.out.format("The cosine of %.1f " + "degrees is %.4f%n", degrees, Math.cos(radians));

    System.out.format("The tangent of %.1f " + "degrees is %.4f%n", degrees, Math.tan(radians));

    System.out.format(
        "The arcsine of %.4f " + "is %.4f degrees %n",
        Math.sin(radians), Math.toDegrees(Math.asin(Math.sin(radians))));

    System.out.format(
        "The arccosine of %.4f " + "is %.4f degrees %n",
        Math.cos(radians), Math.toDegrees(Math.acos(Math.cos(radians))));

    System.out.format(
        "The arctangent of %.4f " + "is %.4f degrees %n",
        Math.tan(radians), Math.toDegrees(Math.atan(Math.tan(radians))));
  }
}
#+END_SRC

* =data/Unboxing.java=

#+BEGIN_SRC java -n :bangle Unboxing.java :padline no
import java.util.ArrayList;
import java.util.List;

public class Unboxing {

  public static void main(String[] args) {

    Integer i = new Integer(-8);

    // 1. Unboxing through method invocation
    int absVal = absoluteValue(i);
    System.out.println("absolute value of " + i + " = " + absVal);

    List<Double> ld = new ArrayList<>();
    ld.add(3.1416); // PI is autoboxed through method invocation.

    // 2. Unboxing through assignment
    double phi = ld.get(0);
    System.out.println("phi = " + phi);
  }

  public static int absoluteValue(int i) {
    return (i < 0) ? -i : i;
  }
}
#+END_SRC

