programming/java/code/tutorial/basic/data.html

<div id="outline-container-org88ee399" class="outline-2">
<h2 id="org88ee399"><code>data/ThisHappens.java</code></h2>
<div class="outline-text-2" id="text-org88ee399">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">ThisHappens</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 3: </span>    <span style="color: #0072b2; font-weight: bold;">StringBuffer</span>[] <span style="color: #e69f00; font-weight: bold;">stringBuffers</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">StringBuffer</span>[10];
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span> = 0; i &lt; stringBuffers.<span style="color: #0072b2; font-weight: bold;">length</span>; i++) {
<span class="linenr"> 6: </span>      stringBuffers[i] = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">StringBuffer</span>();
<span class="linenr"> 7: </span>      stringBuffers[i].append(<span style="color: #848ea9;">"StringBuffer at index "</span> + i);
<span class="linenr"> 8: </span>    }
<span class="linenr"> 9: </span>  }
<span class="linenr">10: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9e868b0" class="outline-2">
<h2 id="org9e868b0"><code>data/ToStringDemo.java</code></h2>
<div class="outline-text-2" id="text-org9e868b0">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">ToStringDemo</span> {
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 4: </span>    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">d</span> = 858.48;
<span class="linenr"> 5: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">s</span> = Double.toString(d);
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">dot</span> = s.indexOf(<span style="color: #848ea9;">'.'</span>);
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>    System.out.println(dot + <span style="color: #848ea9;">" digits "</span> + <span style="color: #848ea9;">"before decimal point."</span>);
<span class="linenr">10: </span>    System.out.println((s.length() - dot - 1) + <span style="color: #848ea9;">" digits after decimal point."</span>);
<span class="linenr">11: </span>  }
<span class="linenr">12: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf9584c8" class="outline-2">
<h2 id="orgf9584c8"><code>data/TrigonometricDemo.java</code></h2>
<div class="outline-text-2" id="text-orgf9584c8">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">TrigonometricDemo</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 3: </span>    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">degrees</span> = 45.0;
<span class="linenr"> 4: </span>    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">radians</span> = Math.toRadians(degrees);
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>    System.out.format(<span style="color: #848ea9;">"The value of pi "</span> + <span style="color: #848ea9;">"is %.4f%n"</span>, <span style="color: #d55e00; font-weight: bold;">Math</span>.PI);
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    System.out.format(<span style="color: #848ea9;">"The sine of %.1f "</span> + <span style="color: #848ea9;">"degrees is %.4f%n"</span>, degrees, Math.sin(radians));
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>    System.out.format(<span style="color: #848ea9;">"The cosine of %.1f "</span> + <span style="color: #848ea9;">"degrees is %.4f%n"</span>, degrees, Math.cos(radians));
<span class="linenr">11: </span>
<span class="linenr">12: </span>    System.out.format(<span style="color: #848ea9;">"The tangent of %.1f "</span> + <span style="color: #848ea9;">"degrees is %.4f%n"</span>, degrees, Math.tan(radians));
<span class="linenr">13: </span>
<span class="linenr">14: </span>    System.out.format(
<span class="linenr">15: </span>        <span style="color: #848ea9;">"The arcsine of %.4f "</span> + <span style="color: #848ea9;">"is %.4f degrees %n"</span>,
<span class="linenr">16: </span>        Math.sin(radians), Math.toDegrees(Math.asin(Math.sin(radians))));
<span class="linenr">17: </span>
<span class="linenr">18: </span>    System.out.format(
<span class="linenr">19: </span>        <span style="color: #848ea9;">"The arccosine of %.4f "</span> + <span style="color: #848ea9;">"is %.4f degrees %n"</span>,
<span class="linenr">20: </span>        Math.cos(radians), Math.toDegrees(Math.acos(Math.cos(radians))));
<span class="linenr">21: </span>
<span class="linenr">22: </span>    System.out.format(
<span class="linenr">23: </span>        <span style="color: #848ea9;">"The arctangent of %.4f "</span> + <span style="color: #848ea9;">"is %.4f degrees %n"</span>,
<span class="linenr">24: </span>        Math.tan(radians), Math.toDegrees(Math.atan(Math.tan(radians))));
<span class="linenr">25: </span>  }
<span class="linenr">26: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf0fc189" class="outline-2">
<h2 id="orgf0fc189"><code>data/Unboxing.java</code></h2>
<div class="outline-text-2" id="text-orgf0fc189">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">ArrayList</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">List</span>;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Unboxing</span> {
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    <span style="color: #0072b2; font-weight: bold;">Integer</span> <span style="color: #e69f00; font-weight: bold;">i</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Integer</span>(-8);
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">1. Unboxing through method invocation</span>
<span class="linenr">11: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">absVal</span> = absoluteValue(i);
<span class="linenr">12: </span>    System.out.println(<span style="color: #848ea9;">"absolute value of "</span> + i + <span style="color: #848ea9;">" = "</span> + absVal);
<span class="linenr">13: </span>
<span class="linenr">14: </span>    <span style="color: #0072b2; font-weight: bold;">List</span>&lt;<span style="color: #0072b2; font-weight: bold;">Double</span>&gt; <span style="color: #e69f00; font-weight: bold;">ld</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">ArrayList</span>&lt;&gt;();
<span class="linenr">15: </span>    ld.add(3.1416); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">PI is autoboxed through method invocation.</span>
<span class="linenr">16: </span>
<span class="linenr">17: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">2. Unboxing through assignment</span>
<span class="linenr">18: </span>    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">phi</span> = ld.get(0);
<span class="linenr">19: </span>    System.out.println(<span style="color: #848ea9;">"phi = "</span> + phi);
<span class="linenr">20: </span>  }
<span class="linenr">21: </span>
<span class="linenr">22: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">absoluteValue</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>) {
<span class="linenr">23: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> (i &lt; 0) ? -i : i;
<span class="linenr">24: </span>  }
<span class="linenr">25: </span>}
</pre>
</div>
</div>
</div>
