programming/java/code/tutorial/basic/data.html

<div id="outline-container-org2536273" class="outline-2">
<h2 id="org2536273"><code>data/ValueOfDemo.java</code></h2>
<div class="outline-text-2" id="text-org2536273">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">ValueOfDemo</span> {
<span class="linenr"> 2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">this program requires two</span>
<span class="linenr"> 5: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">arguments on the command line</span>
<span class="linenr"> 6: </span>    <span style="color: #56b4e9; font-weight: bold;">if</span> (args.length == 2) {
<span class="linenr"> 7: </span>      <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">convert strings to numbers</span>
<span class="linenr"> 8: </span>      <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">a</span> = (Float.valueOf(args[0])).floatValue();
<span class="linenr"> 9: </span>      <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">b</span> = (Float.valueOf(args[1])).floatValue();
<span class="linenr">10: </span>
<span class="linenr">11: </span>      <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">do some arithmetic</span>
<span class="linenr">12: </span>      System.out.println(<span style="color: #848ea9;">"a + b = "</span> + (a + b));
<span class="linenr">13: </span>      System.out.println(<span style="color: #848ea9;">"a - b = "</span> + (a - b));
<span class="linenr">14: </span>      System.out.println(<span style="color: #848ea9;">"a * b = "</span> + (a * b));
<span class="linenr">15: </span>      System.out.println(<span style="color: #848ea9;">"a / b = "</span> + (a / b));
<span class="linenr">16: </span>      System.out.println(<span style="color: #848ea9;">"a % b = "</span> + (a % b));
<span class="linenr">17: </span>    } <span style="color: #56b4e9; font-weight: bold;">else</span> {
<span class="linenr">18: </span>      System.out.println(<span style="color: #848ea9;">"This program "</span> + <span style="color: #848ea9;">"requires two command-line arguments."</span>);
<span class="linenr">19: </span>    }
<span class="linenr">20: </span>  }
<span class="linenr">21: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1cbf606" class="outline-2">
<h2 id="org1cbf606"><code>data/WhatHappens.java</code></h2>
<div class="outline-text-2" id="text-org1cbf606">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #009e73; font-style: italic;">//</span>
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">WhatHappens</span> {
<span class="linenr"> 3: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 4: </span>    <span style="color: #0072b2; font-weight: bold;">StringBuffer</span>[] <span style="color: #e69f00; font-weight: bold;">stringBuffers</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">StringBuffer</span>[10];
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span> = 0; i &lt; stringBuffers.<span style="color: #0072b2; font-weight: bold;">length</span>; i++) {
<span class="linenr"> 7: </span>      stringBuffers[i].append(<span style="color: #848ea9;">"StringBuffer at index "</span> + i);
<span class="linenr"> 8: </span>    }
<span class="linenr"> 9: </span>  }
<span class="linenr">10: </span>}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
